tutorials/immersedBoundary/porousBumpChannelBodyFitted/constant/porousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    porosity
    {
        coordinateSystem
        {
            e1  (1 0 0);
            e2  (0 1 0);
        }

        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (5e7 10 10);
            f   f [0 -1 0 0 0 0 0] (10000 0 0);
        }
    }
)


// ************************************************************************* //
